# include <iostream> /* використовується для організації
введення-виведення в мові С++ */
# include <string.h> /* директива підтримки фунції strlen()*/
# include <stdio.h> /*директива підтримки функції getchar()*/
# define N 255 /* директива означення макросу -- визначає 
константу з іменем N  і значення 255*/
using namespace std;
int main() {
// тіло програми
	char st [N] ;
	cout << "\n\n\n\t\t\tPryvit! Tse -- C++\n\n"; /*
	функція бібліотеки stdio.h для виведення у стандартний
	потік; символ керування \n переводить курсор на новий рядок;
	символ \t задає табулювання на 8 позиційс*/
	cout << "Yak tebe zvaty\n ";
	strlen(st); /*функція бібліотеки stdlib.h; 
	для введення рядка тексту*/
	system("color OB"); /* функція бібліотеки stdlib.h; 
	параметр зміни кольору: 0 - колір фону ( від 0 до F), B -
	колір шрифта*/
	cout << "Pryvit, %s!\a", st; /*  %s вказує, що виводеться значення 
	рядкової змінної st, симол \a задає звуковий сигнал */
	getchar(); /* функція бібліотеки stdio.h для введення символа
	чи затримки екрану - чекає натиснення клавіші Ентер*/
	system("color 0E");
	cout << "Bazhaiu uspikhiv!\n";
	getchar();
	return 0;/* повертає код завершення функції main*/

}

