/*Знайомство з С++*/
# include <iostream> /* âèêîðèñòîâóºòüñÿ äëÿ îðãàí³çàö³¿
ââåäåííÿ-âèâåäåííÿ â ìîâ³ Ñ++ */
# include <string.h> /* äèðåêòèâà ï³äòðèìêè ôóíö³¿ strlen()*/
# include <stdio.h> /*äèðåêòèâà ï³äòðèìêè ôóíêö³¿ getchar()*/
# define N 255 /* äèðåêòèâà îçíà÷åííÿ ìàêðîñó -- âèçíà÷àº 
êîíñòàíòó ç ³ìåíåì N  ³ çíà÷åííÿ 255*/
using namespace std;
int main() {
// ò³ëî ïðîãðàìè
	char st [N] ;
	cout << "\n\n\n\t\t\tPryvit! Tse -- C++\n\n"; /*
	ôóíêö³ÿ á³áë³îòåêè stdio.h äëÿ âèâåäåííÿ ó ñòàíäàðòíèé
	ïîò³ê; ñèìâîë êåðóâàííÿ \n ïåðåâîäèòü êóðñîð íà íîâèé ðÿäîê;
	ñèìâîë \t çàäàº òàáóëþâàííÿ íà 8 ïîçèö³éñ*/
	cout << "Yak tebe zvaty\n ";
	strlen(st); /*ôóíêö³ÿ á³áë³îòåêè stdlib.h; 
	äëÿ ââåäåííÿ ðÿäêà òåêñòó*/
	system("color OB"); /* ôóíêö³ÿ á³áë³îòåêè stdlib.h; 
	ïàðàìåòð çì³íè êîëüîðó: 0 - êîë³ð ôîíó ( â³ä 0 äî F), B -
	êîë³ð øðèôòà*/
	cout << "Pryvit, %s!\a", st; /*  %s âêàçóº, ùî âèâîäåòüñÿ çíà÷åííÿ 
	ðÿäêîâî¿ çì³ííî¿ st, ñèìîë \a çàäàº çâóêîâèé ñèãíàë */
	getchar(); /* ôóíêö³ÿ á³áë³îòåêè stdio.h äëÿ ââåäåííÿ ñèìâîëà
	÷è çàòðèìêè åêðàíó - ÷åêàº íàòèñíåííÿ êëàâ³ø³ Åíòåð*/
	system("color 0E");
	cout << "Bazhaiu uspikhiv!\n";
	getchar();
	return 0;/* ïîâåðòàº êîä çàâåðøåííÿ ôóíêö³¿ main*/

}


